In [1]:
import numpy as np
import pandas as pd

# Pandas utility function #

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

# The opposite one also exist #

In [4]:
pd.notnull(None)

False

In [5]:
pd.notnull(np.nan)

False

In [6]:
pd.notnull(3)

True

 # This function alos works with Series and dataFrame: #

In [7]:
pd.isnull(pd.Series([1,np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [8]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [9]:
pd.isnull(pd.DataFrame({'Column A':[1, np.nan, 7],'Column B':[np.nan, 2,3],'Column C':[np.nan, 2, np.nan]}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

# Pandas operation with missing Values #

In [10]:
pd.Series([1, 2, np.nan]).count()

2

In [11]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [12]:
pd.Series([1, 2, np.nan]).mean()

1.5

# Filtering missing Data #

In [13]:
s = pd.Series([1, 2, np.nan, np.nan, 4])

In [14]:
pd.notnull(s)

0     True
1     True
2    False
3    False
4     True
dtype: bool

In [15]:
pd.notnull(s).count()

5

In [16]:
s[pd.notnull(s)]

0    1.0
1    2.0
4    4.0
dtype: float64

### But both null and notnull are both method of Series and DataFrames,so we could use it

In [17]:
s.isnull()

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [18]:
s.notnull()

0     True
1     True
2    False
3    False
4     True
dtype: bool

In [19]:
s[s.notnull()]

0    1.0
1    2.0
4    4.0
dtype: float64

# Dropping null values #

# Boolean selection + notnull() seems a little bit verbose and repetitive And as we said before any repetitive task will probably have a better,more DRY way in this case
# we can use the dropna method:

In [20]:
s

0    1.0
1    2.0
2    NaN
3    NaN
4    4.0
dtype: float64

In [21]:
s.dropna()

0    1.0
1    2.0
4    4.0
dtype: float64

# Dropping null values on DataFrame #

# you saw how simple it is to drop na s with a series but with DataFrame s there will be a few other thing to consider because
# you cant drop single values ,you can only drop the entire columns or rows
#lets start with a sample DatFrame:

In [22]:
df = pd.DataFrame({'column A':[1, np.nan, 30,np.nan],'column B':[2, 8, 31, np.nan,],'column C':[np.nan, 9, 32,100],
      'column D':[5, 8, 34, 110]})

In [23]:
df

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   column A  2 non-null      float64
 1   column B  3 non-null      float64
 2   column C  3 non-null      float64
 3   column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [25]:
df.shape

(4, 4)

In [26]:
df.isnull()

   column A  column B  column C  column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [27]:
df.isnull().sum()

column A    2
column B    1
column C    1
column D    0
dtype: int64

# the default dropna behaviour will drop all the rows in which any null value is present:

In [28]:
df.dropna()

   column A  column B  column C  column D
2      30.0      31.0      32.0        34

# In this case we are dropping rows, Rows containing null values are dropped from the DF. you can also use the axis parameterto drop columns containing null values:

In [29]:
df.dropna(axis=1)   #axis=column also works#

   column D
0         5
1         8
2        34
3       110

# In this case any row or column that contains atleast one null values will be dropped which can be depending on the case too extreme, you can control this behaviour with the how parameter
# Can be either,' any' or 'all':

In [30]:
df2 = pd.DataFrame({'column A':[1, np.nan, 30,],'column B':[2, np.nan, 31],'column C':[np.nan, np.nan,100]
      })

In [31]:
df2

   column A  column B  column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [32]:
df2.dropna(how='all')

   column A  column B  column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [33]:
df2.dropna(how='any') #Default behaviour

   column A  column B  column C
2      30.0      31.0     100.0

In [34]:
# You can also use the thresh parameter to indicate threshold a minimum number or non null value for the row and column o be kept

In [35]:
df2

   column A  column B  column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [36]:
df2.dropna(thresh=3)

   column A  column B  column C
2      30.0      31.0     100.0

In [37]:
df2.dropna(thresh=3, axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

### Filling null values

In [38]:
s

0    1.0
1    2.0
2    NaN
3    NaN
4    4.0
dtype: float64

# Filling nulls with a arbitrary value

In [39]:
s.fillna(0)

0    1.0
1    2.0
2    0.0
3    0.0
4    4.0
dtype: float64

In [40]:
s.fillna(s.mean())

0    1.000000
1    2.000000
2    2.333333
3    2.333333
4    4.000000
dtype: float64

# Filling nulls with conteageous close values

In [41]:
s

0    1.0
1    2.0
2    NaN
3    NaN
4    4.0
dtype: float64

# The method arguement is used to fill null values with other ones close to that null one

In [42]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    2.0
3    2.0
4    4.0
dtype: float64

In [43]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    4.0
3    4.0
4    4.0
dtype: float64

# this can still leave null values at the extremes of the Series/DataFrame:

In [44]:
pd.isnull(pd.Series([np.nan, 3, np.nan,9])).fillna(method='ffill')

0     True
1    False
2     True
3    False
dtype: bool

In [45]:
pd.isnull(pd.Series([1, np.nan, 3, np.nan,np.nan])).fillna(method='bfill')

0    False
1     True
2    False
3     True
4     True
dtype: bool

# Filling null values on DataFrames

In [46]:
df

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [47]:
df.fillna({'Column A':0, 'Column B':99,'Column C':df['column C'].mean()})

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [48]:
df.fillna(method='ffill', axis=0)

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [49]:
df.fillna(method='ffill', axis=1)

   column A  column B  column C  column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

# Checking if there are NAs

In [50]:
s.dropna().count()

3

In [51]:
missing_values=len(s.dropna()) !=len(s)
missing_values

True

#  There is also a count method that excludes nas from its result

In [52]:
len(s)

5

In [53]:
s.count()

3

In [54]:
# So we could just do

In [55]:
missing_values=s.count() !=len(s)
missing_values

True

# More pythonic solutions any

In [56]:
pd.Series([True, False, False]).any()

True

In [57]:
pd.Series([True, False, False]).all()

False

In [58]:
pd.Series([True, True, True]).all()

True

# The isnull() method returned a Boolean Series with True values whereever there was a nan:

In [59]:
s.isnull()

0    False
1    False
2     True
3     True
4    False
dtype: bool

# So we can just use the any method with boolean array returned:

In [60]:
pd.Series([1,np.nan]).isnull().any()

True

In [61]:
pd.Series([1, 2]).isnull().any()

False

In [62]:
s.isnull().any()

True

In [63]:
# A more strict version will check only the values of the Series

In [64]:
s.isnull().values

array([False, False,  True,  True, False])

s.isnull().values.any()

# Cleaning not -null values

In [65]:
import numpy as np
import pandas as pd

In [66]:
df = pd.DataFrame({
    'Sex':  ['F', 'F' ,'M', 'D', '?'],
    'Age':  [29, 30,24, 290, 25],
})
df

  Sex  Age
0   F   29
1   F   30
2   M   24
3   D  290
4   ?   25

#### Finding unique values:

In [67]:
df['Sex'].unique()

array(['F', 'M', 'D', '?'], dtype=object)

In [68]:
df['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [69]:
df['Sex'].replace('D', 'F')

0    F
1    F
2    M
3    F
4    ?
Name: Sex, dtype: object

In [70]:
df['Sex'].replace({'D': 'F', 'N': 'M'})

0    F
1    F
2    M
3    F
4    ?
Name: Sex, dtype: object

In [71]:
df.replace({'sex':{'D': 'F', 'N': 'M'},'Age':{290:29}})

  Sex  Age
0   F   29
1   F   30
2   M   24
3   D   29
4   ?   25

In [72]:
df[df['Age'] >100]

  Sex  Age
3   D  290

####  And we can now just divide by 10

In [73]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [74]:
df

  Sex   Age
0   F  29.0
1   F  30.0
2   M  24.0
3   D  29.0
4   ?  25.0

# Data cleaning duplicates

# Duplicates

In [75]:
ambassadors = pd.Series([
    'France',
    'United kingdom',
    'United kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany', 
],  index=[
    'Gerard Araud',
    'kim Darroch',
    'peter Westmacott',
    'Armando Varricchio',
    'peter Wittig',
    'peter Ammon',
    'klaus Scharioth'
    
])

In [76]:
ambassadors

Gerard Araud                  France
kim Darroch           United kingdom
peter Westmacott      United kingdom
Armando Varricchio             Italy
peter Wittig                 Germany
peter Ammon                  Germany
klaus Scharioth              Germany
dtype: object

#### The two most important method to deal with duplicate are duplicated( that will tell you which  values are duplicates and drop_duplicates(which will just get rid of duplicates):

In [77]:
ambassadors.duplicated()

Gerard Araud          False
kim Darroch           False
peter Westmacott       True
Armando Varricchio    False
peter Wittig          False
peter Ammon            True
klaus Scharioth        True
dtype: bool

#### In this case duplicated didnt consider 'Kim Darroch' the first instance of the 'United Kingdom' or 'peter Wittig'as duplicates. That is because by default it will consider the first occurance of the value as not-duplicate, you can change this behaviour with the keep paameter:

In [78]:
ambassadors.duplicated(keep='last')

Gerard Araud          False
kim Darroch            True
peter Westmacott      False
Armando Varricchio    False
peter Wittig           True
peter Ammon            True
klaus Scharioth       False
dtype: bool

#### In this case the result is flipped, Kim Darroch and peter Wittig the first ambassadors of their country are considered duplicates
#### but 'peter Westmacott':

In [79]:
ambassadors.duplicated(keep=False)

Gerard Araud          False
kim Darroch            True
peter Westmacott       True
Armando Varricchio    False
peter Wittig           True
peter Ammon            True
klaus Scharioth        True
dtype: bool

#### A similar method is drop_duplicates which just excludes the duplicated values and also accepts the key parameter:

# Duplicates in DataFrame

#### Conceptionally speaking duplicate in DataFrames happens at row levels:

In [82]:
ambassadors.drop_duplicates()

Gerard Araud                  France
kim Darroch           United kingdom
Armando Varricchio             Italy
peter Wittig                 Germany
dtype: object

In [99]:
ambassadors.drop_duplicates(keep='last',inplace=False)

Gerard Araud                  France
peter Westmacott      United kingdom
Armando Varricchio             Italy
klaus Scharioth              Germany
dtype: object

In [102]:
ambassadors.drop_duplicates(keep='first',inplace=False)

Gerard Araud                  France
kim Darroch           United kingdom
Armando Varricchio             Italy
peter Wittig                 Germany
dtype: object

# Duplicates in DataFrame

### conceptionally speaking duplicate in DataFrames happens at 'row' level, two rows with exactly the same values are considered to be duplicates:

In [87]:
players = pd.DataFrame({
    'Name': [
         'kobe Bryant',
         'LeBron James',
         'Kobe Bryant',
         'Carmelo Anthony' ,
         'Kobe Bryant',
],
'Pos': [
    'SG',
    'SF',
    'SG',
    'SF',
    'SF'
]
                       })

In [88]:
players

              Name Pos
0      kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

#### in the previous DataFrame we clearly see that kobe is duplicated but he appears with two different position, what does duplicated say

In [89]:
players.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

#### Again conceptionally, 'duplicated' means "all the column values must be Duplicates" and we can customize this with the subset parameter

In [90]:
players.duplicated(subset=['Name'])

0    False
1    False
2    False
3    False
4     True
dtype: bool

#### And the same rule of keeps still applies

In [91]:
players.duplicated(subset=['Name'], keep='last')

0    False
1    False
2     True
3    False
4    False
dtype: bool

#### Drop duplicates takes thesame parameters:

In [92]:
players.drop_duplicates()

              Name Pos
0      kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [93]:
players.drop_duplicates(subset=['Name'])

              Name Pos
0      kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF

In [94]:
players.drop_duplicates(subset=['Name'], keep='last')

              Name Pos
0      kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF